{
  "trade_identity": {
    "trade_id": "Auto-generated unique ID for this trade.",
    "instrument": "What is the ticker or symbol of the instrument being traded?",
    "entry_date_time": "What was the exact date and time of your entry?",
    "session": "Which trading session was this trade taken in (e.g., Asia, London, NY)?",
    "timeframe": "What was the primary chart timeframe used for this setup?",
    "direction": "What was the direction of your trade (Long or Short)?",
    "trade_type": "What type of trade was this (Scalp, Swing, Position, Day Trade)?",
    "market_condition": "What were the overall market conditions (Trending, Ranging, Volatile, Quiet)?"
  },
  "pre_trade_hypothesis": {
    "setup_or_strategy_name": "What is the specific name of this trading setup or strategy?",
    "htf_bias": "What was the governing Higher Timeframe (HTF) bias or market narrative?",
    "reason_for_entry": "Describe in detail the logical rationale and confluence of factors for entering this trade.",
    "position_size": "What was your position size (e.g., lots, shares, contracts)?",
    "account_risk_percent": "What percentage of your total account equity was risked on this trade?",
    "entry_price": "What was your planned entry price?",
    "stop_loss_price": "What was your initial stop-loss price?",
    "take_profit_price": "What was your primary take-profit price target?",
    "planned_rr_ratio": "What was the planned Risk:Reward ratio for this trade?",
    "screenshot_before_url": "Provide the URL for the pre-trade chart screenshot.",
    "market_catalyst": "Was there any fundamental catalyst or news event driving this setup?",
    "confluence_factors": "List all technical confluence factors that supported this entry (minimum 3).",
    "alternative_scenario": "What was your backup plan if the trade moved against you initially?",
    "time_stop": "Did you set a maximum time limit for this trade to play out?"
  },
  "in_trade_execution": {
    "in_trade_actions_log": "Log any trade management actions taken (e.g., moved SL to BE, took partials).",
    "emotional_journey_log": "Describe the emotions you experienced while the trade was live (e.g., anxiety during drawdown, greed near TP).",
    "plan_deviations": "Did you deviate from your original plan while in the trade? If yes, explain why.",
    "max_unrealized_profit": "What was the maximum unrealized profit reached during the trade?",
    "max_unrealized_loss": "What was the maximum unrealized loss (drawdown) experienced?",
    "trade_duration": "How long was the trade held from entry to exit?",
    "monitoring_frequency": "How often did you check this trade while it was live?"
  },
  "post_trade_analysis": {
    "exit_date_time": "What was the exact date and time of your exit?",
    "exit_price": "What was your final exit price?",
    "final_pl_currency": "What was the final Profit or Loss in your account's currency?",
    "r_multiple_realized": "What was the realized R-multiple for this trade (Final P&L / Initial Risk)?",
    "followed_plan": "Did you follow your pre-defined trading plan exactly? (Yes/No)",
    "what_went_well": "What were the strongest aspects of your planning and execution on this trade?",
    "what_went_wrong": "What were the weakest aspects or mistakes made during this trade?",
    "key_lesson_learned": "What is the single most important, actionable lesson you can take away from this trade?",
    "screenshot_after_url": "Provide the URL for the post-trade chart screenshot showing the full trade lifecycle.",
    "exit_reason": "What was the specific reason for your exit (TP hit, SL hit, manual exit)?",
    "timing_analysis": "Was your entry and exit timing optimal? What could be improved?",
    "setup_grade": "On a scale of A-F, how would you grade the overall quality of this setup?",
    "execution_grade": "On a scale of A-F, how would you grade your execution of this trade?",
    "would_take_again": "Knowing the outcome, would you take this exact same trade again? Why or why not?"
  },
  "ict_analysis": {
    "is_ict_trade": "Was this trade based on an ICT concept? (Yes/No)",
    "liquidity_type_targeted": "What type of liquidity was targeted? (Buy-side, Sell-side, N/A)",
    "liquidity_level_description": "Describe the specific liquidity level targeted (e.g., Previous Day's High, Asian Low).",
    "market_structure_shift_observed": "Was there a confirmed Market Structure Shift (MSS) prior to entry? (Yes/No)",
    "displacement_confirmation": "Was the MSS confirmed with a strong price displacement? (Yes/No)",
    "entry_pattern": "What was the specific ICT entry pattern used? (e.g., FVG, Order Block, Breaker, OTE)?",
    "is_silver_bullet_trade": "Was this an ICT Silver Bullet setup? (Yes/No)",
    "silver_bullet_session": "If yes, which Silver Bullet session was it? (London Open, NY AM, NY PM)",
    "imbalance_targeted": "Was there a Fair Value Gap (FVG) or imbalance that was targeted?",
    "institutional_candle": "Was there a clear institutional candle that created the displacement?",
    "ote_retracement": "Did price retrace to an Optimal Trade Entry (OTE) level before continuation?",
    "algorithmic_price_delivery": "Did price move in a way consistent with algorithmic delivery?",
    "narrative_alignment": "How well did this trade align with the daily/weekly ICT narrative?"
  },
  "psychological_review": {
    "pre_trade_confidence_level": "On a scale of 1-5, how confident were you in this setup before entry?",
    "pre_trade_emotional_state": "Which word best describes your emotional state before entering? (e.g., Calm, Anxious, Rushed, FOMO, Patient)",
    "discipline_score": "On a scale of 1-5, how would you rate your discipline on this trade?",
    "rule_break_analysis": "If you broke a rule, which rule was it and what was the root cause (e.g., emotional trigger, flawed plan)?",
    "post_trade_emotional_state": "How do you feel after closing this trade? (e.g., Relieved, Frustrated, Content, Eager for next trade)",
    "success_replication_plan": "If this was a winning trade, what specific elements of your mindset and process can you replicate in the future?",
    "stress_level_during_trade": "On a scale of 1-5, how stressed were you while managing this trade?",
    "decision_making_clarity": "How clear was your thinking when making entry and exit decisions?",
    "external_influence": "Did any external factors (news, other traders, social media) influence your decisions?",
    "fear_greed_balance": "Did fear or greed play a role in any of your decisions? How?",
    "patience_assessment": "How well did you demonstrate patience in waiting for your setup and managing the trade?",
    "self_talk_quality": "What was the quality of your internal dialogue during this trade? Constructive or destructive?",
    "concentration_level": "How focused were you throughout the entire trade lifecycle?",
    "improvement_commitment": "What specific psychological skill will you work on before your next trade?"
  }
}